In [4]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

ModuleNotFoundError: No module named 'numpy'

- pandas : 2차원 정형데이터 ( 테이블, 표, 데이터프레임)
- 기본단위 : Series
- 1차원 자료구조
- 하나의 데이터 타입

In [ ]:
Series([1,2,3,4])
s1 = Series([1,2,3,4])
s2 = Series([1,2,3,'4'])
s3 = Series([1,2,3,4], index = ['a','b','c','d'])

In [ ]:
s3

a    1
b    2
c    3
d    4
dtype: int64

- 색인 (Indexing)

In [ ]:
s1[0]  # 차원 축소 일어남 >> scalar 값

1

In [ ]:
s1[0:1]  # 차원 축소 x (Series 로 반환)

0    1
dtype: int64

In [ ]:
s3['a']

1

In [ ]:
s3[['a','c']]

a    1
c    3
dtype: int64

In [ ]:
s1 > 2

0    False
1    False
2     True
3     True
dtype: bool

- 연산

In [ ]:
s1 + 1

0    2
1    3
2    4
3    5
dtype: int64

In [ ]:
s4 = Series([10,20,30,40])
s5 = Series([10,20,30,40], index=['c','d','e','f'])

In [ ]:
s1 + s4  # key 가 같은 값끼리 연산 가능

0    11
1    22
2    33
3    44
dtype: int64

In [ ]:
s3  + s5 # key 가 다른 경우 모두 NaN

a     NaN
b     NaN
c    13.0
d    24.0
e     NaN
f     NaN
dtype: float64

In [ ]:
s3.add(s5, fill_value = 0) # 각각에 존재하지 않는 key가 있을 경우 NA 방지 위해 fill_value 사용

a     1.0
b     2.0
c    13.0
d    24.0
e    30.0
f    40.0
dtype: float64

- 기본 메소드

In [ ]:
s1.dtype

dtype('int64')

In [ ]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
s3.values

array([1, 2, 3, 4], dtype=int64)

In [ ]:
s3[['c','d','a','b']] # 색인 사용, 배치순서 변경

c    3
d    4
a    1
b    2
dtype: int64

In [ ]:
s3.reindex(['c','d','a','b']) # 메소드로 배치 순서 변경

c    3
d    4
a    1
b    2
dtype: int64

In [ ]:
s3.index = ['A','B','C','D']
s3

A    1
B    2
C    3
D    4
dtype: int64

In [ ]:
s3[0] = 10 # 값 수정
s3

A    10
B     2
C     3
D     4
dtype: int64

- DataFrame
- 2차원 자료구조 (행과 열 구조)

In [ ]:
#생성
d1 = {'name': ['smith', 'will'], 'sal':[900,1000]}
d1

{'name': ['smith', 'will'], 'sal': [900, 1000]}

In [ ]:
d2 = DataFrame(d1)
d2

    name   sal
0  smith   900
1   will  1000

In [ ]:
d3 = DataFrame(np.arange(1,7).reshape(2,3), index = ['a','b'], columns = ['col1','col2','col3'])
d3

   col1  col2  col3
a     1     2     3
b     4     5     6

- 색인 (Indexing)

In [ ]:
# 컬럼 선택
d3.col3

a    3
b    6
Name: col3, dtype: int32

In [ ]:
d3['col1']

a    1
b    4
Name: col1, dtype: int32

- iloc, loc
- iloc : positional indexing
- loc : label indexing

In [ ]:
d3.iloc[:,0] # 1열 전체 출력

a    1
b    4
Name: col1, dtype: int32

In [ ]:
d3.iloc[:,0:3]

   col1  col2  col3
a     1     2     3
b     4     5     6

In [ ]:
d3.iloc[:,[0,-1]] # 1열 3열만 출력

   col1  col3
a     1     3
b     4     6

In [ ]:
d3.loc[:,['col1','col3']]

   col1  col3
a     1     3
b     4     6